{
  "code": 0,
  "credits": 0.003,
  "result": {
    "items": [
      {
        "appVersion": "323.0.0.35.65",
        "at": "2024-03-25T17:16:31",
        "content": "Great app for the most part, but have been trying for over a year to get notifications to work like I have enabled. I am still not getting push notifications for posts of accounts I follow and enabled. As such, I am missing important updates. I have tried all of the normal tips and still not working. Based on my searches, seems to a recurring issue for other users as well, but still no fix.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "323.0.0.35.65",
        "reviewId": "33858b77-9eed-4af5-8fb0-8d5029cbc20f",
        "score": 3,
        "thumbsUpCount": 141,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWsTrKi36G-l4atq12J4Vg0I9sWxy2FhvxHaQMxmrWppvu3o4iwvg",
        "userName": "Candace W"
      },
      {
        "appVersion": "323.0.0.35.65",
        "at": "2024-03-25T15:00:02",
        "content": "Instagram experience for me is what used to be not a big fan of, recently changed ,as I realized how many awesome photo filters there is on here! Wow amazing filters for everyday photos you can edit, save, delete, whatever . Not to mention it's a very good way,as is Facebook, to connect to basically anyone in a convenient quick fashion.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "323.0.0.35.65",
        "reviewId": "f9bb510a-fbdd-4225-b13b-f02690e20cf1",
        "score": 4,
        "thumbsUpCount": 260,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVkbo_YEhkV7NzbymvycOSe3FczQ9qIuvrCxCfUJZWs373qEmbsOQ",
        "userName": "Carissa Preston"
      },
      {
        "appVersion": "316.0.0.38.109",
        "at": "2024-02-04T13:01:01",
        "content": "There is currently quite a huge issue with this app. When trying to format images in a story, the screen goes completely black and you have to restart the process, upon which the photos get stuck in the 'processing' stage. I have tried every method to fix this to no avail, and am not the only person currently experiencing this. In addition, text keeps turning invisible when you try to write something on your story. Hopefully there will be a fix soon!",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "316.0.0.38.109",
        "reviewId": "ccf0336f-f9b4-41fe-8a18-e2f86ea4a3a7",
        "score": 2,
        "thumbsUpCount": 3763,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXXskx3AUIi4t9gIXd7um78WTHhdKu9ImEdn2drydSwKhxovkw5Eg",
        "userName": "Grace Desrosiers"
      },
      {
        "appVersion": "317.0.0.34.109",
        "at": "2024-02-10T05:48:23",
        "content": "When I add a trending audio track over the video's original sound, the \"Controls\" button that allows you change the volume of both the original audio & the music track no longer works. I cannot turn the volume of the audio track down at all, so it is playing at full volume alongside my original audio. This is extremely frustrating because I want soft background music playing while I talk in the video, but that isn't possible anymore due to this new bug.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "317.0.0.34.109",
        "reviewId": "2c355ee5-9e7d-452b-80b9-f67cd4787362",
        "score": 1,
        "thumbsUpCount": 1612,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUpd2I_kr2MQi7u5zr9vVk31fiL50bumjbBacI4c1yT-0hGo03H0Q",
        "userName": "Brooke H"
      },
      {
        "appVersion": "320.0.0.42.101",
        "at": "2024-03-01T07:41:15",
        "content": "The app is mostly fine. I can't believe that reels, which is basically rebranded Instagram TV or whatever it was called, is still so glitchy. I press and hold a reel to make it bigger and get stuck. Have to restart the app. The time slider doesn't work or disappears half the time. And every time I open a suggested reel, it tells me I can scroll to see more. Like as though I don't know that by now. Also, where is the opt back in to political suggested posts? Does it even exist? Or are you lying?",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "320.0.0.42.101",
        "reviewId": "753f6c6a-bd8a-4153-a82e-c15b870aeebb",
        "score": 2,
        "thumbsUpCount": 9303,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW7YjhSrMwJ8Wa2db8HF3vkB2_cPnIxXDxvbrktMqxf787oHg53CA",
        "userName": "Tsuki-San"
      },
      {
        "appVersion": "320.0.0.42.101",
        "at": "2024-03-05T23:58:31",
        "content": "So many issues. I think every update just messes something else up. I use IG mostly for video chats and all of a sudden I can't connect to Bluetooth and I no longer have a full screen of the person I'm talking to nor do they get a full screen of me it's just two half photos on top of each other. Trash. The sound is not the best if you are in a room with anyone else since staying connected to Bluetooth is almost impossible. I would love to go back to normal video calls. Now instagram is down! 🤦",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "320.0.0.42.101",
        "reviewId": "492c723b-f663-444b-9a2e-40759a083c7a",
        "score": 1,
        "thumbsUpCount": 8139,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUNXqKNRb-0aPZf-5PBLQSxThDlanoG4ZItS7s4z8qzcTzXAjcE",
        "userName": "Jennifer B"
      },
      {
        "appVersion": "317.0.0.34.109",
        "at": "2024-02-10T04:40:03",
        "content": "I've been using IG for years but the functionality has been gradually going downhill, especially compared to other platforms. Constant glitches and features disappear and reappear from one minute to the next. Not user-friendly at all, especially when creating reels. For example, SOMETIMES (not always) there's an option to crop a cover image for the square grid view but even after cropping it reverts back after posting. Also adding sounds and multiple texts to reels is glitchy and frustrating.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "317.0.0.34.109",
        "reviewId": "fc1fe6f7-b6dc-43fa-a41e-1b6340c1a7c5",
        "score": 1,
        "thumbsUpCount": 1067,
        "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocL1MW5N7l1_W4JX0v91eEBBqlHbogSJGeC7ojgG4jEUTLN3_w=mo",
        "userName": "D. Rene"
      },
      {
        "appVersion": "317.0.0.34.109",
        "at": "2024-02-10T07:15:48",
        "content": "Everytime I try to post multiple pictures and add music behind it, it won't give me the option like everyone has. When I'm in the middle of editing pictures to posts, the screen will freeze and go black. I'm forced to restart the app and sometimes that doesn't even work, I have to restart my phone entirely. I don't always receive all of my messages, some will appear and become visible and some won't.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "317.0.0.34.109",
        "reviewId": "d96114ed-dfb9-4afc-9b31-8d464929d968",
        "score": 1,
        "thumbsUpCount": 1151,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXZlNMhkeIdp4weHRHckKYIJ03DSVRmWbL0qoz1Ci26_hnsOJo",
        "userName": "MsDemonic"
      },
      {
        "appVersion": "320.0.0.42.101",
        "at": "2024-02-29T16:57:03",
        "content": "I like instagram, but this app has a lot of issues lately. Ever since updating the app a couple of weeks ago, I can no longer add my own posts to my story. The button no longer exists. I only have the option to share. Yes, I clicked on both the plane icon and the 3 dots and it's not there anymore. My account is public. I checked on a friend's phone and she has the story button. I have cleared storage and reinstalled it, but nothing works. This is extremely frustrating to deal with.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "320.0.0.42.101",
        "reviewId": "a298ac61-d11d-4bcc-8262-317e43f96c2c",
        "score": 2,
        "thumbsUpCount": 4605,
        "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocI9aRzYVdmgyvUXv1sEXRydj10G9b6BsBE539trUOvT4QuIHA=mo",
        "userName": "Ruth Kim"
      },
      {
        "appVersion": "317.0.0.34.109",
        "at": "2024-02-11T04:15:54",
        "content": "Algorithm is terrible. No matter how many ways you try to manipulate your feed, or pick not to see certain things, the same things are pushed into your feed. Many different times I went through and selected not to see certain posts for a variety of reasons. I come back to the app later in the day only to have the exact same for you page as what was cleared out earlier in the day. Posts displayed in the same order and everything. Over, and over and over again. Meta is peddling garbage.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "317.0.0.34.109",
        "reviewId": "ddc57f9f-c9da-43f2-abfb-ba5e1b0449f0",
        "score": 1,
        "thumbsUpCount": 931,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXymiC38-H9SaJ53zSOqmB8CNbXqoHq432qMxKc1PErWCDWAoo",
        "userName": "Tyler Sommer"
      },
      {
        "appVersion": "318.0.0.30.110",
        "at": "2024-02-17T05:56:18",
        "content": "Their AI detection bots are incredibly inaccurate, which is extremely frustrating. Tried to make a second account to share art and potentially start a small biz (as many people do) and was immediately disabled for no reason. When appealing, apparently taking a selfie of my real human face and confirming a code via phone number wasn't enough because I can't appeal again. And there is no way to get in touch with an actual human when something like this happens. Great app. Great customer service.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "318.0.0.30.110",
        "reviewId": "748456f9-125a-48db-8928-09600d03727f",
        "score": 1,
        "thumbsUpCount": 1353,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXhfcIvpZytAKGlcv8PFXzQndFsx-UIgILpemaGq0VSqZOXIT8",
        "userName": "Summer"
      },
      {
        "appVersion": "319.0.0.43.110",
        "at": "2024-02-25T16:32:34",
        "content": "This app is great when it works. I often have to wait a long time for updates to actually get to my phone. With having different accounts, the update will only be on one account and not the others. Sometimes when I redownload the app, the update is completely gone. I've had to move accounts consistently because the app would be on an older version ONLY for that account. It's frustrating. If I'm on the app too long it'll break and I'll need to reopen it. Other than that, it works as intended.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "319.0.0.43.110",
        "reviewId": "d146393a-0cca-4f6b-8ea5-d9cc2c0f67bb",
        "score": 3,
        "thumbsUpCount": 1676,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXBjnSfCd7Ra5oEwiXPuaHZRrOM8ie09U1GpwpYtorsJCTYekv7Zw",
        "userName": "sai"
      },
      {
        "appVersion": "320.0.0.42.101",
        "at": "2024-03-03T22:27:56",
        "content": "App is okay. At best. 1) Algorithms are trash. Starts on a random feed you likely haven't seen yet, just before refreshing itself to show you a whole new recycled feed. 2) Photo sharing consistently degrades quality. 3) Pausing videos is buggy. Sometimes it works, sometimes it doesn't. Goes hand in hand with: 4) The NEW problem of not being able to go forward or back on a video while it's playing. If this wasn't an accidental bug, you should probably reconsider. Please fix?",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "320.0.0.42.101",
        "reviewId": "46e62a2f-cfe8-4aa2-b61a-58a3ef6f0f85",
        "score": 2,
        "thumbsUpCount": 1236,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUwSVWiCvGllOmD7v9d9BshBpxAO9MLAVCwVTNFcEY8M4q5XXY",
        "userName": "prod Wolfy"
      },
      {
        "appVersion": "320.0.0.42.101",
        "at": "2024-02-29T00:48:19",
        "content": "This app has become so poor I'm so close to leaving it completely. Tagging people resets the post. Adding photos to a draft resets the post. Selecting multiple photos for a post doesn't work half the time. Basic functions have become broken to the point that I don't have time to deal with the multiple attempts and this is coming from a full time creator. Going to just focus on my YouTube content now, I'll post here when I have time to waste and a high bandwidth for frustration.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "320.0.0.42.101",
        "reviewId": "b77bb58d-93d1-4fb2-8f2e-7d406fd847e1",
        "score": 1,
        "thumbsUpCount": 1615,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVdrLsxKzp8y-ILxAxjdRn3iDTV9NEESsguvOGt6oemAuo4wXH1",
        "userName": "Kevin McCuiston"
      },
      {
        "appVersion": "319.0.0.43.110",
        "at": "2024-02-23T12:07:06",
        "content": "The android version has always been so buggy, and it only gets worse over time. Key aspects that should work do not and it makes it hard to be able to use the app at all. Photo cropping does not work and resets any edits you've made constantly. The pin to profile/unpin doesn't function properly. If you open a link in someone's bio in dark mode, it immediately bugs out the whole UI when you return from the link... the list goes on.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "319.0.0.43.110",
        "reviewId": "79b8a629-b50f-4848-8322-44d79797d211",
        "score": 1,
        "thumbsUpCount": 2909,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU_L5i4c2G7nGdGftefBOtESs3Q3n8gCQCuY7biDbCGIyERWuM",
        "userName": "Cheyenne Nichols"
      },
      {
        "appVersion": "318.0.0.30.110",
        "at": "2024-02-15T02:53:40",
        "content": "This app is okay. However, refusing to copy other platforms can make it better. Equally, an ever-changing algorithm, constant glitches, and a lack of originality make this platform extremely difficult to enjoy and grow. Even worse, at the time of this review, everything is Reels, Reels, Reels. This excludes individuals wanting to share images, etc. Long story short, it sucks. 😶",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "318.0.0.30.110",
        "reviewId": "caf6f8f8-0ea9-4f7c-8e9a-34a8ad5db1c5",
        "score": 2,
        "thumbsUpCount": 1468,
        "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocI9wn4WiqI8CDnzxPCc1lhP7m-UhBxCblO1fN92Stim40g0ww=mo",
        "userName": "Kiwi"
      },
      {
        "appVersion": "323.0.0.35.65",
        "at": "2024-03-25T22:03:49",
        "content": "Messages in the app are not being delivered properly. One party will send and the other will not be able to view on their end. It happens quite often and has been very frustrating. *edit - the previous problem has been resolved, but now it seems activity status has been effected across my entire inbox.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "323.0.0.35.65",
        "reviewId": "1e375f3b-4fe3-480e-8dcf-59018b430cb9",
        "score": 2,
        "thumbsUpCount": 8,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUoSyjCmmaKffYHF60F1f-mR4okU_EwcMpcn5QZgEbEiHI1YPzcow",
        "userName": "Tanya Brandom"
      },
      {
        "appVersion": "318.0.0.30.110",
        "at": "2024-02-14T14:05:23",
        "content": "I really like it my one complaint off the top of my head is how easy it is to accidentally call someone, it happens a lot because it's just one button idk maybe they could fix that or not either way its a good app. Edit: over time my opinion has changed. Very easy to get hacked, happens A LOT. Bad costumer service I, nor did my friends get any help. Also glitchy as hell, and constantly won't let me do the simplest of tasks.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "318.0.0.30.110",
        "reviewId": "ac618479-5d75-4b37-8726-6d38e50ba111",
        "score": 2,
        "thumbsUpCount": 1070,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUxqTNNGkyZoE64-54LB8JtO5eDKwAOvlQKrH9agdsYPYqA4b8",
        "userName": "Emi Smith"
      },
      {
        "appVersion": "319.0.0.43.110",
        "at": "2024-02-24T10:19:30",
        "content": "it's starting to be less fun. I use the app mostly for family, friends, and looking at sports highlights, food, and comedy. The notification icon will say I have notifications, but then it's all \"suggested for you\" but most of the \"suggested\" are accounts where we dont have any friends in common. and mostly spam accounts. Also you can only pause notifications for 8 hours. After that there will be messages and what's in them going across the screen. Tried to turn it off or pause, but no.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "319.0.0.43.110",
        "reviewId": "9d62fdde-fd9f-4ce5-843e-f58bd0f45e23",
        "score": 2,
        "thumbsUpCount": 943,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWOuE27gLQaa0-xV5gyrbta0aheK_F1Pql074u-Ap9HhY1rWnk",
        "userName": "Abel T"
      },
      {
        "appVersion": "318.0.0.30.110",
        "at": "2024-02-14T09:20:56",
        "content": "I used to love this app, but it no longer works for me when using wifi. Posts and stories will not load at all unless you're using data (and running up your phone bill). The problem persists even with the most recent update. I've tried every troubleshooting fix I can find, and reported it multiple times, with no change. Maybe it's time to switch to a different platform, since this one seems to be dead.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "318.0.0.30.110",
        "reviewId": "63d536f5-3f65-483c-9324-38799bb45da1",
        "score": 1,
        "thumbsUpCount": 1228,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXKDdT0rX_12d7alMiNd4yYkEExCuT1HLdeF_vtTo4QmBaUYE5u",
        "userName": "Sarah Patten"
      },
      {
        "appVersion": "322.0.0.37.95",
        "at": "2024-03-18T11:27:49",
        "content": "In the past, before new updates, it seems I have more probs of using, some free music when posted. I can't remove my pinned post, it's missing the feature. I uninstalled and it and the update acted like a pre installed app, when it's a third party app. It says this app is compatible. I can use the app to an extent. it says it is unable to update being partly not connected to the Play store. Hope you'll be able to fix it.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "322.0.0.37.95",
        "reviewId": "444d6615-0f1d-418c-8708-c9a90ff22eb0",
        "score": 2,
        "thumbsUpCount": 2286,
        "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLxpNdRlUaAkimr4j7NJ-zCW9gtgTtL0-ABUgUoIN9db1F6jQ=mo",
        "userName": "clark villalovoz"
      },
      {
        "appVersion": "316.0.0.38.109",
        "at": "2024-01-31T19:29:49",
        "content": "Horrible now. After a recent update, it no longer accesses my SD card where I had all my photos and videos. 3 days of frustration. I read another review about the SD card issue and figured it out. Very annoying. I've used Instagram for 10 years and now this. Very unhappy. *Update Jan 31st 2024.*. They listened and did another update and now it will access my SD card so I can go back to normal.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "316.0.0.38.109",
        "reviewId": "0743630d-6fa5-4159-ae11-b8f8864ad545",
        "score": 3,
        "thumbsUpCount": 1728,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXvn1e9Cr9a6HFxXZkDyWb4z31lmkKhYAOo9ho9iQM3GbiJ670",
        "userName": "K M Taylor"
      },
      {
        "appVersion": "317.0.0.34.109",
        "at": "2024-02-13T06:31:26",
        "content": "I've been using this app for a few years and I enjoy it but over the past few months I've found some really annoying glitches. My main issues are that sometimes I'll try to add some recently posted stories to a highlight and they won't show up in the select menu. Also, the images for my post drafts delete after around 12-18 hours, the caption will be intact but I won't be able to post it since the pictures/videos are gone. Despite that, I still enjoy the app and Ive found some nice communities.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "317.0.0.34.109",
        "reviewId": "8e443ca6-3d3d-4e4e-8744-36cc6251b1ad",
        "score": 4,
        "thumbsUpCount": 1223,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXbMED37wf6ZiG1jLEdNXzx0eWS21j4kX5SqDEKwiJg-o2JtZHl",
        "userName": "Faye Smith"
      },
      {
        "appVersion": "317.0.0.34.109",
        "at": "2024-02-13T00:33:49",
        "content": "It's gotten worse. Reels keep bugging out, not uploading (even when the internet is good), and then I lose my reels!! There needs to be a backup or just save it if it doesn't upload the first time and/or have an option to physically try again. One reel I waited an entire week with different wi-fi/data and was STILL unable to upload. The fact that I lose all my work just because YOUR app doesn't work is seriously stupid.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "317.0.0.34.109",
        "reviewId": "d3644d70-b86a-4ffc-b134-abf9b8f75bd7",
        "score": 1,
        "thumbsUpCount": 356,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVfxRESL9L1Mj8WM-Epyh-k6MobPdlbiVh9KpPH0kNT8tEB6fI",
        "userName": "AnimeFreak792"
      },
      {
        "appVersion": "320.0.0.42.101",
        "at": "2024-03-06T00:06:29",
        "content": "So today I get an error message when I try to do anything \"cannot refresh feed\". Message failed to send. Something has gone horribly wrong. I have full bars of service and zero problems with any other apps/ internet. Recent update wiped out my actual \"newsfeed\" No I don't want to only see 3 suggested reels of people who I don't know. What is this? Slowly getting rid of yet another of the few parts of Instagram I actually liked. This app used to be about sharing photos with friends.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "320.0.0.42.101",
        "reviewId": "3035966b-34d0-44e0-8925-15df9544f0d5",
        "score": 1,
        "thumbsUpCount": 442,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVyVPvfL0lL-eZgl4tgswwtP4nWMrF2Nq28t8hnvXZGpdTKaQ",
        "userName": "Mary S"
      },
      {
        "appVersion": "316.0.0.38.109",
        "at": "2024-02-06T15:22:51",
        "content": "Extremely extremely buggy. Even the help center isn't letting me report anything. There are so many things happening where my instagram is glitching. I cant send people photos, videos take forever to send, I can't send voice messages etc. And this has been going on for over a week now. On all my accounts. I'm really not sure what's happening.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "316.0.0.38.109",
        "reviewId": "d7b18734-01ab-421a-90d3-97ad9b6dcbba",
        "score": 1,
        "thumbsUpCount": 435,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV2_2eHD-iJ0MzGRi5xo0RX9VhS3DgsOuZRDBIwmGtEaiBdcAAv",
        "userName": "T-Rene' Burns"
      },
      {
        "appVersion": "321.0.0.39.106",
        "at": "2024-03-08T08:29:19",
        "content": "The moment you decided to changed the way to watch videos and reels regarding guidebar that is used to go further or back in the video, is when the quality of this app significantly decreased. Fix your app, it should be no reason the bar is so damn close to the bottom of my screen to where it causes difficulty in functioning. I can barely can use it with my fingers because of how small and low it is. And bring back being able to pause videos without having to hold it.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "321.0.0.39.106",
        "reviewId": "4e6001d0-d5e9-44cb-8546-d67f0697e991",
        "score": 1,
        "thumbsUpCount": 65,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX9LKYmXxVrkHwGXr-mvucGfifJTJ9Q7gq18ToktrLMs8zNskiS7w",
        "userName": "Darrien White"
      },
      {
        "appVersion": "318.0.0.30.110",
        "at": "2024-02-17T02:26:48",
        "content": "I can't load ANYTHING on this app, regardless of my connection strength & if I'm on Wi-Fi or data! I've tried re-installing several times to no avail, along with force stopping & clearing all data. Absolutely nothing. Not only that, but the following feed purely consists of accounts I don't and will never follow. If I wanted to explore, there's an explore tab for a reason!",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "318.0.0.30.110",
        "reviewId": "e296715e-2742-4eca-bb73-eea4906b5f16",
        "score": 1,
        "thumbsUpCount": 376,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUnhc4cUB9LysP2BA4oLDMb1kT7gthumxJAsgC5TFtv4mEKJyWlCw",
        "userName": "Kryntox"
      },
      {
        "appVersion": "322.0.0.37.95",
        "at": "2024-03-15T03:08:39",
        "content": "The new font is absolutely terrible, it's so hard to read and not accessible (for me at least, it looks blurry and I can't read it easily) and things keep moving around?? They weren't broken so idk why they were changed, it doesn't look great and is very confusing, just keep it the way it was!! It was fine! Nothing. Was wrong, and if there was a bug, just fix that, not how it looks.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "322.0.0.37.95",
        "reviewId": "2c2892b5-13ef-4d13-9691-c5cba1b5814e",
        "score": 2,
        "thumbsUpCount": 409,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVNBy-Tj3xsZGxv6Hxrx0vZ4xB8yOvruG4QTDVO0iiI3brgP6xB",
        "userName": "Everett Puglisi (Ev)"
      },
      {
        "appVersion": "318.0.0.30.110",
        "at": "2024-02-23T14:36:56",
        "content": "Worked well for maybe the first few weeks -- I've been having a constant problem where my DMs won't load, won't show new messages, or are all gone. The search bar doesn't work; no message history and you can't see their response. I still get the notification when they DM me but it won't load if I try to click through the notification. I tried all troubleshooting methods and sent several reports to support but no response even after a long time. Would not recommend as an app to communicate.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "318.0.0.30.110",
        "reviewId": "4495c36f-2334-43d3-85c1-dcec72c65edb",
        "score": 1,
        "thumbsUpCount": 450,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXf5Z3k1c5XId_h7QJK1b-nMIxKunTIsjrNXXEIqyp9dIeeqc6p",
        "userName": "Jeremy T"
      },
      {
        "appVersion": "320.0.0.42.101",
        "at": "2024-03-02T09:33:57",
        "content": "I use this app primarily to post content for my clients but I have grown to love to create content. Cool video, cute meter's , reels and stickers on the stories. But recently this app has taken a downhill turn. I can't look up or use any audios, all I get are suggested music audios that quite frankly, suck. I also have to constantly rewrite a reel text 5 times because this app keeps deleting my text whenever I make a post, reel or photo. And it's getting annoying. Do better.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "320.0.0.42.101",
        "reviewId": "51e7c54f-ab19-462f-8c91-2cc67ef6f364",
        "score": 1,
        "thumbsUpCount": 1221,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjURyT-4CgpQsfHz2wav9KVe4vSRwULvEE0-dY3Dal7EkSkmxFzM",
        "userName": "shelby gruhns"
      },
      {
        "appVersion": "319.0.0.43.110",
        "at": "2024-02-27T10:31:30",
        "content": "Originally reported in 8/2023. STILL HAPPENING. I must delete then reinstall the app multiple times a day. The app continues to revert back to the old version and glitch out. Stories are affected, missing filters and features like my avatar. My chat themes are a mess.. From randomly not showing at all to missing graphics, there's several issues. After having and using the app for several years, why suddenly are there issues that aren't getting fixed??",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "319.0.0.43.110",
        "reviewId": "a24c3a19-5465-457f-bd88-8e454874e494",
        "score": 1,
        "thumbsUpCount": 782,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVlQbMmQjuE9eVAG1jTw8TeEWCkuLFloah4oshrXfk7TII2XQSr",
        "userName": "Ana Scheidecker"
      },
      {
        "appVersion": "316.0.0.38.109",
        "at": "2024-02-01T03:22:58",
        "content": "It's a okay app. Until recently, when I was told by people they had not heard back from me. I never got the messages! Had to check via browser on my laptop to even see them! I have lost business when I could have used it because of it. On top of that I haven't been able to use the draft feature in years. If I save something to draft, it will tell me only that it cannot be posted. I just have to post regularly. So that feature is absolutely useless to me. I have reported these issues repeatedly",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "316.0.0.38.109",
        "reviewId": "1bdcc684-577b-49e4-993e-a3807c8e5f1a",
        "score": 2,
        "thumbsUpCount": 616,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWvfeKRetipF4IP6jIbRNcANd2XP4N-Tt1u-DlXqdw4hRkYoyZ1rA",
        "userName": "Chelsea Heller"
      },
      {
        "appVersion": "321.0.0.39.106",
        "at": "2024-03-07T23:17:33",
        "content": "It would be a fantastic app if the bugs were fixed. Everytime I attempt to log in to an account and error message pops up. I've tried resetting my passwords, opening my accounts from the website, and trying to log in through email links but nothing has been working. The lack in quality when posting an image is also very irritating. This app would definitely bring more people in if the ones behind it fixed the issues.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "321.0.0.39.106",
        "reviewId": "e9c0edf0-bbb0-44cc-a887-0c2c9ce411af",
        "score": 3,
        "thumbsUpCount": 618,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWUXEchQvLZXUUScDibyO1uoy_PnmV58ikFpCpNg_OXqA2lwszs",
        "userName": "Sarah R"
      },
      {
        "appVersion": "321.0.0.39.106",
        "at": "2024-03-10T08:41:24",
        "content": "How can such a popular, widely used app still have such an awful mechanism for pausing or fast forwarding in a video? Oh, good, the reel restarted AGAIN. If only I could skip the part I already watched! Nope. Beyond being a waste of time in-general and showing you content you don't care about, even when you find something you DO want to see, this app's functionality is awful and seemingly intentionally wastes even more of your time. Trash",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "321.0.0.39.106",
        "reviewId": "9dad1e7a-acab-43c1-9837-454c6037e2d4",
        "score": 1,
        "thumbsUpCount": 744,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVqcIzxge33iSsM6o-xrh-3tyiHTGraLCF7tzwvHTh43iu9GOts4w",
        "userName": "Robert Brent"
      },
      {
        "appVersion": "318.0.0.30.110",
        "at": "2024-02-21T13:04:37",
        "content": "I enjoy instagram more than I like Facebook for sure. Although the constant random glitches and the app closing randomly doesn't make it enjoyable, it is rather irritating. Looking through the accounts I follow, it constantly resets itself back to the top of the list if I even touch the screen. And many more \"glitches\" along with that... Overall, FIX your app, please.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "318.0.0.30.110",
        "reviewId": "b4c34699-4495-43fd-9568-bdcbca2d3d4b",
        "score": 2,
        "thumbsUpCount": 395,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXQRo8SOJ-0BhDaugwz6UgRqvAOsQePN7bV9JnnUd9n2q2Hp_8k",
        "userName": "Shawna Burnett"
      },
      {
        "appVersion": "319.0.0.43.110",
        "at": "2024-02-26T12:58:27",
        "content": "All of a sudden, the numbers always added to upper corner of each post will not disappear. Usually could tap and wait & it would disappear so could take screen shot if wanted to add to an album, with out the number being in the face or other places when the photo looks so much better without the #'s planted on. Ok to be there as they do make sense of things but much better when we could delete for screen copy.. WHY won't they erase now??? Tks.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "319.0.0.43.110",
        "reviewId": "c534c9bd-4db0-4263-8fca-90b46796302c",
        "score": 4,
        "thumbsUpCount": 492,
        "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKTBFDLb2PQ8wzO3W4-nS9F0YZHsOihbYQgldPap3WoxtOClw=mo",
        "userName": "Harriet. I. Paul"
      },
      {
        "appVersion": "316.0.0.38.109",
        "at": "2024-02-02T13:41:53",
        "content": "They continually rearrange the options, making it progressively harder to use. There's no customer service number, and when attempting to delete one of my accounts, it was challenging; I couldn't find the option. Even when I located it, I couldn't delete it because the app kept crashing. Instagram hasn't been the same since FB acquired it.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "316.0.0.38.109",
        "reviewId": "722c7f4d-fd60-467e-81da-0754597110fa",
        "score": 1,
        "thumbsUpCount": 666,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVLywLjR9o3HXfnt45nDKvkN7QsG_SHWTXSyEX7lB5_F-RTyoKgSQ",
        "userName": "Wali Syed Qadri"
      },
      {
        "appVersion": "320.0.0.42.101",
        "at": "2024-03-06T00:18:13",
        "content": "Its like the only app I use these days. But I do have some problems with it. First off, I get really annoyed at the fact that I can't get notifications sometimes. Idk if it's just my phone or if it's the app itself but it's annoying. Another, I hate that all videos (unless as a slide thing) are reels. I just want to unmute the video but it takes me to reels. It is just aggravating. Other then that I don't have any more problems with this. I just wish these would be fixed at some point.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "320.0.0.42.101",
        "reviewId": "138615b7-b503-4527-a931-929997625f49",
        "score": 4,
        "thumbsUpCount": 732,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUziVqrDzZbWl4kF_tzKlwuSofGSKWAiI9jhb6vf4KpvQLpUa0",
        "userName": "Connor Coe"
      },
      {
        "appVersion": "318.0.0.30.110",
        "at": "2024-02-22T07:52:50",
        "content": "Every time I try to edit or add a tag , it glitches out and doesn't save anything. This app keeps screwing up my post, and it's croping my pictures in a ridiculous way. I have to use a third-party app to make the image fit. I am an author, and I see no point in using this app anymore to try and promote my book if it's just gonna keep messing up and not saving my edits. Very unreliable. Idk what they did to this app, but after all these updates, they made it worse. Lazy coding and poor management",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "318.0.0.30.110",
        "reviewId": "73555693-1514-4eba-8e14-d9a3e039f9d1",
        "score": 1,
        "thumbsUpCount": 172,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXQT5FKsppOSjyGXbvnFbpSxqp-dR0HuYePtaeP03C2XTNf18eP",
        "userName": "A"
      },
      {
        "appVersion": "321.0.0.39.106",
        "at": "2024-03-13T00:11:14",
        "content": "Update is really messing with the app. Anytime I try to fast forward or rewind a reel, it freezes and I have to exit the video completely, needs to be fixed. Also, whenever I try to edit a highlights cover photo, the photo will flip strangely, or it will glitch and zoom in on a part of the cover photo when saving the changed highlight cover.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "321.0.0.39.106",
        "reviewId": "f7725efc-7cc7-4fa2-bb14-9cac62f84936",
        "score": 2,
        "thumbsUpCount": 353,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWiw_kxWi7IwRKdugJgOoBhz7mkoElS94AJZGinaAcfqsYCD6Za",
        "userName": "Samantha Lamb"
      },
      {
        "appVersion": "321.0.0.39.106",
        "at": "2024-03-06T03:15:35",
        "content": "Can't upload videos to story. Can't send bug reports. Can't log in. Videos refuse to upload and fail at 90%. I tried sending a bug report. Nope. Bug report fails to send. Tried updating. Nope. Tried clearing cache. Nope. Tried Uninstalling and reinstalling. Guess what, now I can't log back in. I enter my email and password, but none of the 2FA methods are working. Won't send notifications. Won't send confirmation code text messages. Locked out and unusable.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "321.0.0.39.106",
        "reviewId": "ea26c389-5aae-4486-9df1-83ccb169bb09",
        "score": 1,
        "thumbsUpCount": 1116,
        "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJYigg4gAqaYxD3r0Ca4BiQelyoJQ-ieAxxdT5mSqkYRPogJw=mo",
        "userName": "Jacob"
      },
      {
        "appVersion": "320.0.0.42.101",
        "at": "2024-03-02T00:20:43",
        "content": "It seems there's a glitch where the bar at the bottom where I used to be able to fast forward to go to a specific spot in the reel isn't allowing me to do this anymore. Not sure if it's a glitch or if that feature was removed. But it is impacting my experience with Instagram pretty negatively because I don't want to have to watch the whole reel from the beginning if I want to see a specific part of the video.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "320.0.0.42.101",
        "reviewId": "da8ec69e-7a9c-44ee-8df0-1982392f4234",
        "score": 2,
        "thumbsUpCount": 473,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVTROK8kon1OqwfwKK0h5NMtyAqKU5Tg6RjfGeuzhJmlmaotzwD",
        "userName": "Monica Jee"
      },
      {
        "appVersion": "323.0.0.35.65",
        "at": "2024-03-24T00:55:14",
        "content": "An increasing amount of invasive ads haunt this app. Businesses who aren't even on Instagram and have 10 Facebook followers. For some reason it thinks I am into \"Hair transplants\" and \"Engagement rings\" when both of those are completely irrelevant to me and I've never searched them. I have tried avoiding those topics saying not interested only to see them more often. I don't want to see trending reels on my main page, I miss when it was just people you follow. No way to customize the home page!!",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "323.0.0.35.65",
        "reviewId": "a9b48125-6f17-48e7-84a6-a6b7743ad62e",
        "score": 1,
        "thumbsUpCount": 52,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVLIP-tiyDyt9X69QfyWNXgRDfdNPPW_sg9acu42m2_7u4pkzA",
        "userName": "Joel C"
      },
      {
        "appVersion": "323.0.0.35.65",
        "at": "2024-03-24T11:38:49",
        "content": "I'm kinda new to Instagram. So, I'm just learning how to create reels, polls, content and the RULES! I receive pop-ups telling me I've been restricted...often! I have 2 choices to choose from (1) OK or \"let us know if you think we're wrong!\" Normally, I hit \"ok\" and back to normal within a few hours! Hit the other one and I couldn't \"like, follow, comment\" for a week week or maybe it was bc I uninstalled and reinstalled? Either way they never told me why or how long! But recommend. I love app!",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "323.0.0.35.65",
        "reviewId": "69df6c40-967a-4499-8019-6391c3e0f62f",
        "score": 4,
        "thumbsUpCount": 4,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXMWASdHF5MyaOr3apBEi9_33Sl3KLlROk9fF7-omSwyLxoOBDD",
        "userName": "Shannon Carrier"
      },
      {
        "appVersion": "322.0.0.37.95",
        "at": "2024-03-14T13:10:00",
        "content": "IG is a disaster after recent updates. I'm constantly getting \"waiting for connection\" errors when posting to stories. The story continues to try to post indefinitely and never fully sticks. Cleared cache, restarted my phone, deleted and reposted the story 3 times to no avail. Just a wheel of death waiting for connection. Sometimes the back arrow closes the app instead of going from the chat to main page. Glitchy, please fix.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "322.0.0.37.95",
        "reviewId": "f0152723-78c3-4aa2-b5fe-65ec29f54860",
        "score": 2,
        "thumbsUpCount": 72,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjULUpACIJnx_hNxpP41z2c6Id2fdlqMeVdQuqWpChnE9ZeWWLkxaw",
        "userName": "Sarah Becker"
      },
      {
        "appVersion": "320.0.0.42.101",
        "at": "2024-03-02T01:50:57",
        "content": "Reel videos are glitched now, when you tap on the video, the scroll bar at the bottom disappears. Also on videos, the bottom 1/3rd part of the video is completely obscured by the video information which you can't dismiss. (the Name of the poster, Description, Song Name, etc, cannot be minimized) Also posts don't show the date of posts anymore. Instead, it shows the number of \"weeks ago\" that photos/videos were posted.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "320.0.0.42.101",
        "reviewId": "84f37f0b-e1e1-4328-89cf-2b79dc377b68",
        "score": 1,
        "thumbsUpCount": 731,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWQFajVaf2R_SW9873X88wfMiDitsvYy63aWGyB33qbO2-KUJ2e",
        "userName": "Ethan Omer Fox"
      },
      {
        "appVersion": "322.0.0.37.95",
        "at": "2024-03-18T02:45:08",
        "content": "What is w/ Insta & loading older photos. I can see them just fine in my photos app, so I know they're there, but on Insta they're either greyed out & can't be clicked on, or despite scrolling down it will start to repeat the same few images. It happens everywhere, dms, posting, story. Super annoying glitch! Oh yeah, this has been going on for a while now.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "322.0.0.37.95",
        "reviewId": "85a52040-b92f-41fb-ae7b-4930568685bd",
        "score": 3,
        "thumbsUpCount": 469,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVtd1t_B4A4s9OKYgfFaEWRazVo4xshg9ujJDizr_Csd1ym0nvb",
        "userName": "S.H Gogo (SoundBraker)"
      },
      {
        "appVersion": "316.0.0.38.109",
        "at": "2024-02-01T09:41:25",
        "content": "As other people have been explaining, I have also been experiencing the negative aspects of this app. I cannot post any pictures from my camera roll, period. I've uninstalled, reinstalled, given permission, cleared cache, you name it, and I STILL cannot post pictures. I've deleted the app until this is fixed. I've been having this issue on Threads as well. Instagram needs to fix this issue for users ASAP. The app was updated and this issue has been resolved. Thank you!",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "316.0.0.38.109",
        "reviewId": "37920bf0-cdc6-4983-b8f7-16b14b0af51f",
        "score": 4,
        "thumbsUpCount": 405,
        "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLtwmIQkm5aXFY6LaGgmCIqFA_YPLM_Z-9254NqvPc-KrFcXQ=mo",
        "userName": "Brianna Phillips"
      },
      {
        "appVersion": "320.0.0.42.101",
        "at": "2024-03-04T12:18:56",
        "content": "My feed is nothing but \"suggested for you\", even though I said to disable it in the setting. It's very annoying. I want to see what my friends are up to, not pictures of cats from accounts I don't know and nothing else. When I X a suggested post and open the content settings, it says suggested posts have been snoozed every time. This is clearly not true, given that I got to that settings page from dismissing a suggested post. Nothing but a headache",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "320.0.0.42.101",
        "reviewId": "9aadc0e4-dc2d-4311-bc6f-a469004dcfce",
        "score": 1,
        "thumbsUpCount": 336,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVzPKsu9TgrammdWpbfrdKYp3wgAPShUSlPIU_OW9mkEP-LfH06",
        "userName": "Dylan Wilson"
      },
      {
        "appVersion": "316.0.0.38.109",
        "at": "2024-02-06T01:53:46",
        "content": "Even with hashtags no one sees photos anymore - and reels are hit and miss. The editor for reels always crashes and also saves tons of edited videos on my phone even after posted or deleted, so my Instagram winds up with a storage of up to 10gb. For phones with less storage that's impossible. It has a lot of problems even if you don't consider the algorithm completely not caring about small creators.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "316.0.0.38.109",
        "reviewId": "661ef886-1bbe-46c0-8a78-ed3754f789ad",
        "score": 2,
        "thumbsUpCount": 277,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUVqjM1V67a4iM3JDpdOrAHM-e3XiQeKPto9lWRsPmDnbbzoaUT",
        "userName": "sammirureka"
      },
      {
        "appVersion": "323.0.0.35.65",
        "at": "2024-03-26T07:02:33",
        "content": "One of the worst apps. If it isn't glitching out, the algorithm is keeping you buried. I've tried the boosted ad's, and they barely meet the minimum reach but somehow still get all of the money. Now the like counter is hiding a large portion of the likes I received. You can view them in the insights, but they don't show on my profile. Help center hasn't replied to any of my reports or emails.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "323.0.0.35.65",
        "reviewId": "5f3da700-377f-4dd3-a1d2-1808538277f2",
        "score": 1,
        "thumbsUpCount": 154,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV9YyFqSsFWjb23DvGiBoZ5RtYYxVXLkDwFQvVT7hMzBFd_sE5QYg",
        "userName": "Kathryn Daniels"
      },
      {
        "appVersion": "321.0.0.39.106",
        "at": "2024-03-11T13:34:28",
        "content": "Terrible commenting system. It only serves to promote hate and fuel anger and it's clearly done on purpose to drive \"engagement\". Old: I wish there was more control over when it refreshes/auto-scrolls to the top :/ Old: It's pretty frustrating to use. The video player functions don't really work - they also removed landscape as an option, as far as I can tell.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "321.0.0.39.106",
        "reviewId": "48342919-9e02-4bf1-8e88-a56441b6bc41",
        "score": 1,
        "thumbsUpCount": 304,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXS_LB8u28UUzSMmlQu2YdDjYnkdjKFiMah905v3L9lvxwyzlm2",
        "userName": "iRokr"
      },
      {
        "appVersion": "317.0.0.34.109",
        "at": "2024-02-14T13:25:13",
        "content": "Bugs kept happening in my chats where after sending a message, the text I just sent reappears in my text box so I have to delete it. And there is another where I can receive videos from friends but half the time it won't even send a 18 second clip from my camera roll, I've never had these issues 2/3 years ago but now I'm experiencing them a lot more than what I used to",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "317.0.0.34.109",
        "reviewId": "42168075-2871-4a56-b69d-908a6af5186d",
        "score": 2,
        "thumbsUpCount": 150,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVqeT20HOSVS1p-pUaS8ns_fJSHduVaViJ-YspwHh5zeM37Zxs",
        "userName": "Alex Applegarth"
      },
      {
        "appVersion": "323.0.0.35.65",
        "at": "2024-03-21T06:32:03",
        "content": "if I wanted to see the next reel I'd swipe. stop auto playing the next reel. I've turned off everything I could to stop it and it just keeps auto playing. I'm really glad insta shows how much they're trying to sensor specific pages, not loading specific pages, videos and pictures. also I wish there was a \"don't show this add\" option. I keep seeing adds for games about popping pimples and I want to vomit every time. I hate the \" invited you to their insta live!\" no they didnt and idc.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "323.0.0.35.65",
        "reviewId": "eb49fdd4-5de6-45c5-8923-0e8428c69096",
        "score": 1,
        "thumbsUpCount": 512,
        "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJ5Q6crvtAq0rd_85s4IRTTjP3nTakU0nDBT2f7iCuULIWfjw=mo",
        "userName": "Samantha Shim"
      },
      {
        "appVersion": "323.0.0.35.65",
        "at": "2024-03-19T06:17:56",
        "content": "I'm not sure why, but all of a sudden I can't use direct messages. I can send it, but after I do, the error message \"Message Unavailable: This message type isn't currently supported\" pops up & all of my messages can't be seen. They're just gone. Idk if this is my account or the app? But it's very frustrating. I've tried several things that i googled to fix it & still nothing. & I'm not the only one having these types of issues. Please help me figure it out & fix it.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "323.0.0.35.65",
        "reviewId": "47e05592-33b0-4bac-b84b-f89ef20fc60f",
        "score": 1,
        "thumbsUpCount": 650,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWA2sij46jP7nA553yjjyzbhBsV4CHAozjD-bb1CVYgtI9h6Ur7ZA",
        "userName": "Cass W"
      },
      {
        "appVersion": "323.0.0.35.65",
        "at": "2024-03-22T00:06:48",
        "content": "You vex me. I zoom in and set t my ten photos how I want, but then click \"next\" and all the photos reset to their original size and orientation. Grrrrrrr Also, duck me if I have to minimize the app to do something else on my phone, because when I go back into Instagram, all my work is lost and I have to restart. This app is both amazing and so so so infuriating to work with. I dread using it to post. Please be better.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "323.0.0.35.65",
        "reviewId": "49eaec51-1d63-412f-bb47-44c1a53d5758",
        "score": 3,
        "thumbsUpCount": 710,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUrj4Rbwzf_8zlUJyG8kvmKCqOrKF5bqnntJlteDGkYPInJAFbb",
        "userName": "Stephanie Blair"
      },
      {
        "appVersion": "316.0.0.38.109",
        "at": "2024-02-03T10:32:45",
        "content": "Not sure what's going on. Can't post any video to my story, can't use a GIF in my story. The boomerang/video option doesn't work, keeps saying that recording has failed. *Update* I am still having problems with this app. It's been updated, I've logged out, re started my phone multiple times and I still can't post any videos or Boomerangs or anything on my story with a GIF. The only thing I can post on my story is a picture, nothing extra",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "316.0.0.38.109",
        "reviewId": "de8abb76-4a26-46a9-af99-1644f9eeb0b9",
        "score": 1,
        "thumbsUpCount": 388,
        "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLfKPPopEXSY__0sbeKNagCCY13HSIMHOJ_78YjlhGbhJUdEw=mo",
        "userName": "Tara Gunderson"
      },
      {
        "appVersion": "318.0.0.30.110",
        "at": "2024-02-21T10:41:23",
        "content": "Dark mode issues on android still has huge problems. Confirmed on both my old note 10 and ultra 23. You will be browsing and all of a sudden the text will turn black and you won't be able to see it on a black background. Or once in a while the background and text turns white. Usually you can close Instagram and reopen and UT resolves. But it's going on a few years with the same issue.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "318.0.0.30.110",
        "reviewId": "0f9b8652-b234-4775-be05-48e9331251ac",
        "score": 2,
        "thumbsUpCount": 345,
        "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKzRBBZLuP6lUgU3id7jUG1_-8L9GJLZsqyp0oXtt6LOXDzfg=mo",
        "userName": "Todd Larsh"
      },
      {
        "appVersion": "317.0.0.34.109",
        "at": "2024-02-10T01:55:27",
        "content": "This app is consistently getting worse. You haven't been able to search most recent posts in quite some time, instead given the option to search by top recent (mostly the same posts as top posts). When you search through follow lists half of the time it takes you back to the top of the list when you touch the screen after clicking a profile and going back. Terrible for a AAA app.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "317.0.0.34.109",
        "reviewId": "a9882484-c27e-410a-90e4-0be8d0f8173c",
        "score": 1,
        "thumbsUpCount": 191,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXwVS8IzCi1y6CrEk8tyPTolTL7aXEjYMLZdrDKEKa5p82PSpo",
        "userName": "Panzerkampf"
      },
      {
        "appVersion": "320.0.0.42.101",
        "at": "2024-03-01T00:03:40",
        "content": "Stories freeze and wont play properly cant use saved audio on a story, only on reels because IG is trying to shove that feature down everyone's throat just like stupid \"threads\" and now, when a video or reel is playing and you try to fast forward or rewind, it freezes completely. Not to mention the fact that the functional layout of posting a reel, story, or post are all different = user unfriendly! It only lets you use pics for stories from your camera roll, and not other folders. What a joke!!",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "320.0.0.42.101",
        "reviewId": "94824bfc-cf12-4328-87b4-d01c10c1c5e5",
        "score": 1,
        "thumbsUpCount": 262,
        "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJpN5hzZ1o1IHBHp0LgJ0WDN9VmrVDHPMncL4XDzBY8daTDCw=mo",
        "userName": "Cuyler Clifton"
      },
      {
        "appVersion": "320.0.0.42.101",
        "at": "2024-03-04T03:07:10",
        "content": "IG has possibly the worst interface I've ever experienced. There is a progress meter at the bottom, but if you try to use it, the video pauses permanentlt. Mute? Permanent pause. Any kind of interaction but scroll up or down? (Which restarts the video) Start from zero. I give up. Jesus people, test the garbage you write before using it to sell my data.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "320.0.0.42.101",
        "reviewId": "312b8979-3f05-4344-a475-ca6d9f749ef1",
        "score": 1,
        "thumbsUpCount": 266,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXKLSg-eubsMvcwWE7gyqXewu1iAk-syKX3iWY_WeZ4hFS-ElE6",
        "userName": "Rich Bell"
      },
      {
        "appVersion": "317.0.0.34.109",
        "at": "2024-02-17T06:03:52",
        "content": "My feed in constantly filled with ads and other \"promoted\" pages that I have zero interest in. Factored in with the consistent bugs encountered, I'm moving my ranking down to 2 stars. Still better than Facebook but it's clearly on its way to making itself a thing of the past, like Facebook. UPDATE: 1 star. Nothing but ads for lip fillers and botox. Instagram is absolute trash.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "317.0.0.34.109",
        "reviewId": "e3f3e991-4b40-4d38-9ac0-9fc8c9df4f49",
        "score": 1,
        "thumbsUpCount": 145,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVnezLmPxb2wuNB6GBe42XDRHszaRIyZdhAPwBpz94NPUwzSHQ",
        "userName": "Grant Hutzel"
      },
      {
        "appVersion": "318.0.0.30.110",
        "at": "2024-02-22T07:10:34",
        "content": "A true hellscape of an app. Constant ads, even directly on the profiles of accounts I follow. Far more sponsored content than in the past, and now there are automatic website pop-ups on accounts that advertise to me. No matter how many accounts I block, the experience is soul-crushing. I tend to go many months without looking at Instagram because I hate it so much. Only good thing is the saved collections, because I don't want to publicly like everything that interests me.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "318.0.0.30.110",
        "reviewId": "b830f5c3-6a8f-43ec-8e9c-743a33dac1ee",
        "score": 1,
        "thumbsUpCount": 150,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUphirAUOjGDmzy24TBYoxbAuSlLCTncI3kurI3rNzW3Vv1oIA_",
        "userName": "Amanda K."
      },
      {
        "appVersion": "320.0.0.42.101",
        "at": "2024-03-02T12:59:46",
        "content": "TERRIBLE BUGS OR TERRIBLE APP CHANGES!!! Keeps getting worse & worse! They removed the pause button a while ago - pls bring back! Now unable to fast forward or rewind videos bc the playback freezes so bad. Unable to see the button during playback that shows how long the video is or how far into the video you are. WHO IS COMING UP WITH THESE CHANGES - THEY NEED TO BE REASSIGNED!",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "320.0.0.42.101",
        "reviewId": "9780bcf1-f47e-478d-b6fb-56725a111a9b",
        "score": 1,
        "thumbsUpCount": 370,
        "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJyof9sgNVMaTpNNlQLoZDp-Kxv4tSJwAh4NuktmF9jko1RUw=mo",
        "userName": "Pearl London"
      },
      {
        "appVersion": "320.0.0.42.101",
        "at": "2024-03-01T06:13:13",
        "content": "Buggy, when viewing the followers/following list of anyone, it often scrolls back to the top, making you restart. Is this a permanent feature? It's been a problem for years. I've also uploaded a reel only to have its audio constantly replaying in the background even after I've clicked away from the upload, it stops once I fully exit and close the application.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "320.0.0.42.101",
        "reviewId": "6fd654a5-36ac-435e-bbc9-484a508620a6",
        "score": 1,
        "thumbsUpCount": 321,
        "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJWs1z3qUTMXx-D4DiV727PUEKFlGpmtHHrK6Q_7ZtSGqjxUQ=mo",
        "userName": "The new kid"
      },
      {
        "appVersion": "322.0.0.37.95",
        "at": "2024-03-14T07:23:29",
        "content": "Just started using insta and went through all my pics so I knew what I wanted to post. Whether story or feed seems like the limit of 10 photos or videos is pretty limited. Out of any vacation I have never just taken 10 photos. Trying to pick out of an amazing trip or adventure is impossible. Breaking up feeds or stories is nonsense. Would just stick to snap for stories going away. Gave into limit and picked 10. Hit share to insta and only stories/reel showed up. Select 1 and got feed, fix bug.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "322.0.0.37.95",
        "reviewId": "795d7901-6691-4ecc-b2cb-545899597792",
        "score": 2,
        "thumbsUpCount": 143,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXVZSPVeqThTl2CYehf9XhEGPlzLckov0GiAi21mGtNyALqNgM",
        "userName": "Jan Matavovsky"
      },
      {
        "appVersion": "323.0.0.35.65",
        "at": "2024-03-25T05:19:33",
        "content": "When uploading stories, it says error and the red ring around my profile pic shows, but the story never really uploads. It especially happens for videos and when I zoom in and out on photos while in the story editing. Randomly logged out for 12 hours last week. The whole app freezes if I click pages or buttons too fast. Profile pics show as blank for a couple mins before finally loading. Stop laying people off, that's when all these glitches started!",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "323.0.0.35.65",
        "reviewId": "c3dc29a7-5abe-4ae7-aa91-49e9b5003c69",
        "score": 2,
        "thumbsUpCount": 21,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUhMwnoXjOO31PWxlgvFsTx0B_4XMzNE5SbGG7IMuSEtzuSbqJlfg",
        "userName": "Ryan F"
      },
      {
        "appVersion": "321.0.0.39.106",
        "at": "2024-03-12T00:34:55",
        "content": "Whatever new update they rolled out is awful. Specifically on reels. The buttons don't work anymore, you'll press share and it'll bring you to the creator's profile, comments and it'll pause and become non-responsive to touch. The UI is horrible for such a common app. Did you hire children to complete the coding? There's a new auto-scroll feature that I blame for it - and who needs it? I can scroll on my own, I don't need the phone to dictate when I'm done on a certain video.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "321.0.0.39.106",
        "reviewId": "badae9a1-f11f-4fd6-b9a6-4cabbafed57b",
        "score": 1,
        "thumbsUpCount": 30,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWGHwcc9gG34j7-iT5Qz0KMMAoVDtgmw2nE9DDV3c2yWTS_PNl5",
        "userName": "Clifford"
      },
      {
        "appVersion": "323.0.0.35.65",
        "at": "2024-03-22T08:06:45",
        "content": "Settings do not actually change anything. Turned off notifications from people liking comments. Those notifications still pop up. All the time. What's the point of giving the option to change settings if they don't actually change the settings Edit: still hasnt changed. New though, somehow while scrolling, I got logged out entirely??",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "323.0.0.35.65",
        "reviewId": "41eaa135-f12d-43d9-8136-3c939076549d",
        "score": 2,
        "thumbsUpCount": 12,
        "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIqOpNVooqHbbsFnknxiIyShp0j5ruyTuTS3ECZStGULcFPFQ=mo",
        "userName": "Lance Mangangey"
      },
      {
        "appVersion": "321.0.0.39.106",
        "at": "2024-03-11T19:07:12",
        "content": "Videos always freeze and glitch, which results in me closing the app and losing the reel I was previously looking at. I hate that posts on the explore page automatically scroll up. Now I can barely click comments, and I don't like that it pops up \"report spam, post on story etc etc,\" when you barely touch a comment. The algorithm is also horrible! I am tired of seeing the same posts that I saw days ago.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "321.0.0.39.106",
        "reviewId": "92bd37a7-e23a-4eea-85c9-1e83a289b44f",
        "score": 1,
        "thumbsUpCount": 33,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVqimG-gjMMFhqq8eALZ-m8eybzxpcvc8DSGVdK3tUocbLj3WJP",
        "userName": "Keeyona B"
      },
      {
        "appVersion": "319.0.0.43.110",
        "at": "2024-02-23T20:11:42",
        "content": "Update 2/20: Did repeat troubleshooting on my Samsung S24+. When I uninstall and reinstall, the app works for that time in I'm initially in there after install. But when I go out of it (not logout) and try to go back to it, it crashes again like before. But that's actually progress. UPDATE 2/23: The latest update has fixed the crashing! Thank you all so much for your hard work!",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "319.0.0.43.110",
        "reviewId": "9326375f-e290-494c-a897-cf9963a6cf98",
        "score": 5,
        "thumbsUpCount": 646,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXwKQChrcxFc4WG36bh64JHQCunwm5SA9UbO8RrnTAcAinDDi8g",
        "userName": "Latonia Price"
      },
      {
        "appVersion": "320.0.0.42.101",
        "at": "2024-03-06T01:24:32",
        "content": "Thank you for fixing the bug but I want to give some feedback. When I was going through issues with my account, it was hectic trying to find help. To try reading all those articles or whatever on the help center page was not helpful. I recommend having chat support. At least then I can have someone to talk to and if it is a simpler issue, they can just redirect me to the specific page. This is better than having to frantically click all over the website, get more aggravated, and feel lost.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "320.0.0.42.101",
        "reviewId": "001041a5-fb22-4c89-b663-d16eb7062ae1",
        "score": 2,
        "thumbsUpCount": 232,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVzVzOf-t1UPWuvWdOGmvz9L6NLZRv2Q-_eL4-KE_s7BRnI6P-z",
        "userName": "max"
      },
      {
        "appVersion": "323.0.0.35.65",
        "at": "2024-03-22T22:36:17",
        "content": "This app needs a serious overhaul and update. It is not for androids. Android users are getting updates late and the app is still continuously glitching. Update: 11/16/22 App is still glitching. I'm seeing posts that are 3 days old and it will not show me any new posts. What us going on with this app!? Too many bugs and glitches. When someone sends you a reel it doesn't open on that specific reel. It opens to something else.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "323.0.0.35.65",
        "reviewId": "2c20ab72-b0c5-406a-90f9-3fb241bc3c6a",
        "score": 1,
        "thumbsUpCount": 35,
        "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLg0BmWEC-DCLQSSaGENRsQl8kPOW0_cKWSMaSAtoJgJyOiGQ=mo",
        "userName": "J'Chateau"
      },
      {
        "appVersion": "316.0.0.38.109",
        "at": "2024-02-03T16:33:36",
        "content": "For the most part I like the content. Being able to share posts with friends is lovely. I like how you can share stories and even create highlights. I like some of the suggested content or discovering new things. I don't like how some settings suck. Like how it auto refreshed and now I lost what I was looking at. Or how I may looking a reel and it just moves on to the next reel without my permission. Like what the heck I wasn't done yet. I also don't like how I cannot pause a reel, it just goes",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "316.0.0.38.109",
        "reviewId": "61cadc0c-d8a2-4188-a4d3-e59b4dd7fe88",
        "score": 3,
        "thumbsUpCount": 303,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUn030JEa-7sfYJsKyfzOS3TcnNKA78J8nZ69A24vr0hD_RYEOX",
        "userName": "Stephanie Hau"
      },
      {
        "appVersion": "323.0.0.35.65",
        "at": "2024-03-22T19:32:01",
        "content": "I used to rate this app 5 stars but with all the issues it's been having I'm dropping it down to a 2 star rating. Latest issue this app has had is the one where a lot of users (me included) were randomly logged out of their accounts. I've been putting my correct username and password and it keeps asking me for backups codes and when I put them it says invalid. I officially can't log back in to my account because of this dumb servers and issues that keep happening at least once or twice a month.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "323.0.0.35.65",
        "reviewId": "b55b7260-55d0-480c-94e0-5b8831ef351e",
        "score": 2,
        "thumbsUpCount": 30,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWAdOUjps7nD_Ud8-SAQQz6we75W460RIwbYsU74MpTH6ESPzYSQQ",
        "userName": "Xamir"
      },
      {
        "appVersion": "322.0.0.37.95",
        "at": "2024-03-17T00:34:33",
        "content": "Reel editor freezes every time I want to edit a video. When I finally got through it, the video wouldn't post (may have been my wifi so ok on that one). I deleted the app to see if the bugs were just from a previous version of the app. When I reinstalled it I couldn't get into my account without 2 factor auth, and the support page was buggy and wouldn't let me submit a support ticket. So frustrating",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "322.0.0.37.95",
        "reviewId": "4b207d63-16cf-4560-9f15-8d779719600b",
        "score": 1,
        "thumbsUpCount": 690,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVKIpI49srpf5TBiG28KxYpMLRbAvYcQWde6VThtytPr6SzeK5B",
        "userName": "Amanda Eakin"
      },
      {
        "appVersion": "322.0.0.37.95",
        "at": "2024-03-13T21:50:53",
        "content": "I've had this app for years and just starting to really dislike it more and more with every update. I primarily use IG for my stories because the capabilities are better and I can share it to FB with one setting. Convenient, I know.... Until ut stops working the way it's supposed to. I can't even record in my story anymore. Every time I try it deletes the whole thing and says the file type is unsupported. I've actually had to start recording stories on TikTok and just share them to IG, and to FB",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "322.0.0.37.95",
        "reviewId": "6c9d5966-2bc2-49c5-9f6b-150eaacfee85",
        "score": 2,
        "thumbsUpCount": 366,
        "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLZ9_bj7L63e3aQK76-lMjUQ_VodrCk47KhBeO8-Dk4yAWbIQ=mo",
        "userName": "JilliBean K"
      },
      {
        "appVersion": "323.0.0.35.65",
        "at": "2024-03-22T10:33:05",
        "content": "App is okay but I don't know if it's a me problem but... it logged me out randomly and when I tried to log back in, it said it couldn't find that account. I tried to recover, I never got the email. I did it again, never got one again. And then when I finally got in, my insta was not up to date anymore. I didn't have my notes dashboard anymore (even tho I did before) and I also didn't have a customize button for my emoji reactions. I redownloaded and yeah, doesn't work. No more notes dashboard...",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "323.0.0.35.65",
        "reviewId": "e1c2f1f3-99e9-4bb3-bd4d-d6c6c06b2a31",
        "score": 3,
        "thumbsUpCount": 4,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX5HT08U7391yciiKVPeLD6uLE8FZHwBooO65vzummxJl6FjE66jA",
        "userName": "Aaliyah"
      },
      {
        "appVersion": "321.0.0.39.106",
        "at": "2024-03-11T22:45:14",
        "content": "This used to be a good app until the recent updates. Reels are borderline unwatchable as none of the functions for them work. You can't scroll up or down without being sent to the main user's page, you can't click on the like button or see the comments without having to tap on them multiple times, and before, the rewind and scroller was broken too. Please fix these issues soon.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "321.0.0.39.106",
        "reviewId": "62268277-71bb-4708-a4c2-210b748f30d4",
        "score": 2,
        "thumbsUpCount": 301,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV7XCncOHs09GfBbuqawtNXlCg3y0hV5JssXNvvKi5fJ31EAV6x",
        "userName": "David Davis Jr."
      },
      {
        "appVersion": "323.0.0.35.65",
        "at": "2024-03-22T03:08:09",
        "content": "My original account was hacked and removed. When I have tried to have a reviewed or get in contact with anyone in any form, I have hit a brick wall. When I try to recover it it will not allow a code to go to my phone (probably going to hacker ) which will then not allow me to communicate with Instagram for a review. I love the platform and how accessible it is for business, but I am so frustrated with the communication side directly in recovering many years of lost content.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "323.0.0.35.65",
        "reviewId": "126aeb6c-7b3d-4d74-a0c2-88517c6c1b40",
        "score": 2,
        "thumbsUpCount": 3,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXhWexrL-Nbg7K6MZCfAQotP7d9Tk-p1lc2KPwbKGze_E07zt4uAA",
        "userName": "Aimee Pendleton"
      },
      {
        "appVersion": "320.0.0.42.101",
        "at": "2024-03-04T14:18:39",
        "content": "Nothing works consistently, this app is a mess and forces me to use square aspect ratios if I don't want to post one picture at a time. The desktop version is worse, after editing and adjusting pictures, almost every time it says it can't post, and there's no \"save as draft\" on desktop so however much time I spent finding the pictures and adjusting them is just wasted. Makes me want to find another hobby, because trying to post anything I make here is a nightmare.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "320.0.0.42.101",
        "reviewId": "c3d1ed6d-d1c3-4f77-9efa-76df00002784",
        "score": 1,
        "thumbsUpCount": 345,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUwLn2Gi_AXcSRyB6rIpHddpt9-bWDBDFcwHcSIQ-ficF7YhVWEcA",
        "userName": "Clayton Smith"
      },
      {
        "appVersion": "317.0.0.34.109",
        "at": "2024-02-07T09:50:09",
        "content": "can scroll down my timeline with no issue but if I try and go to somebody's profile and view a post or go to the explore page and view a post I get spammed a message that repeats itself so fast I can't even read it and the app gets stuck like that. I have to close it and reopen it to get it to stop but it starts all over again if I try and do any of the things mentioned before",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "317.0.0.34.109",
        "reviewId": "d13757a5-7723-4df8-b97f-0b46a30a85aa",
        "score": 1,
        "thumbsUpCount": 178,
        "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLuYhanecoNZbI4KO0JcY-W1vQ1xo0kgmoEwEp1GEAmGlMw3A=mo",
        "userName": "the professor"
      },
      {
        "appVersion": "320.0.0.42.101",
        "at": "2024-03-04T05:02:52",
        "content": "This app is frustrating! The bar for the videos no longer works. It makes the video freeze. You can't zoom in anymore without it freezing. There's so many ads also. Almost every other video is an ad. I keep seeing ads for a mr. breast game that is not owned by him like it says. How is this legal? Their using his name because they know how popular he is! Y'all finally fixed it to see the comments on a reel while in Facebook. But at the same time, it's still messed up. 500 characters is not enough",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "320.0.0.42.101",
        "reviewId": "3844ae2a-52e8-48ab-840d-cb42dbb66efd",
        "score": 1,
        "thumbsUpCount": 771,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUgNWViUHFONXnwx9NHl1S6dRNWot8RbnioDH0O5fQNpaPRLHCC",
        "userName": "Heather W"
      },
      {
        "appVersion": "321.0.0.39.106",
        "at": "2024-03-10T01:11:06",
        "content": "I've had so many issues with this app over the years, but most get worked out fairly quickly. This must recent one is horrible though. I cannot even open the app. Every time I try, my screen just goes blank. Nothing comes up at all. I can't log in on any of my accounts like this. I can't check messages. I can't see any data, post anything, just nothing at all. I cannot find any way to take off the latest update so I can at least get some functionality back... just everything is blank.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "321.0.0.39.106",
        "reviewId": "4d4d7dde-33e0-4343-9140-fd9bd7527e59",
        "score": 1,
        "thumbsUpCount": 58,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUTgzYJBcx2vZYUnRcYwwY_1UiCQ7AJnhYidspX2REsgAKgoKUU",
        "userName": "Jessica Reid"
      },
      {
        "appVersion": "321.0.0.39.106",
        "at": "2024-03-06T00:09:10",
        "content": "Can't even log in properly. I've tried everything to log in to my old accounts. But there seems to be an error everytime and saying \"couldn't refresh feed\". This has happened TWICE with some of my old accounts too, I had to create new ones and now there's a trouble logging in in my new ones too. Too many bots and definitely not a safe place for kids. Really poor service even after I tried everything including, fixing my wifi, clearing the app cache, even restarting my device.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "321.0.0.39.106",
        "reviewId": "9dbe7566-9c31-44cc-8b56-f2cbac974824",
        "score": 1,
        "thumbsUpCount": 844,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXvNmUe-ey_bMk6FHwO1XtOaSnITVxAyc_5ptd4Ip8s65YHacs",
        "userName": "Kristel Hoxha"
      },
      {
        "appVersion": "322.0.0.37.95",
        "at": "2024-03-13T23:05:50",
        "content": "One of my go-to doom scrolling apps, it has been completely ruined by recent updates. From automatically scrolling to the next reel while I'm reading comments, to vibrating each time I like a comment, to \"sponsored reels\", etc. With no settings to turn off any of these features, I can't stand using this app anymore. Don't even bother with this app, just download tiktok instead.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "322.0.0.37.95",
        "reviewId": "f486fc8d-3334-4e88-9976-2e686ab9dbfd",
        "score": 1,
        "thumbsUpCount": 304,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVh0QMpH9a1EMDKv9vCLYKsXonIURYK-XhLETxO1XBr1usjqZb_",
        "userName": "Titan Mastery"
      },
      {
        "appVersion": "320.0.0.42.101",
        "at": "2024-02-29T00:03:34",
        "content": "Latest misadventures. For over a month my explore feed has been assorted India/Bollywood, people dancing, generic nature photos, and other nonsense I've never shown any interest in. Many on Reddit reporting the same thing. Like others, have tried everything to fix it and it's still completely trashed. Terrible app. Non existent support, to boot.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "320.0.0.42.101",
        "reviewId": "636b2b8d-5eea-4269-902f-ff5ea7d05116",
        "score": 1,
        "thumbsUpCount": 107,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXodeniZ8gtkpK6c9iDam8c_Ppd4SM3lIRIuA-R7mXvUjY5v4bqbA",
        "userName": "K G"
      },
      {
        "appVersion": "323.0.0.35.65",
        "at": "2024-03-22T07:13:59",
        "content": "Since the last two updates I have been unexpectedly logged out of my account so many times. At first I thought my account was getting hacked but now I think it's the app it self, thought updates was to make the app better not worse but it keeps happening for no reason. I'll be on it then I'll get an error message then I'm logged out. Please fix tired of it",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "323.0.0.35.65",
        "reviewId": "1b8a23a3-6cc6-4f7b-aed9-939e4203408d",
        "score": 2,
        "thumbsUpCount": 9,
        "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJZevq8eZrG2FiYOJkA5aKKcOrrmYu12PqJ2lPPa2AaAWhTmw=mo",
        "userName": "Emily Moore"
      },
      {
        "appVersion": "320.0.0.42.101",
        "at": "2024-02-28T22:12:30",
        "content": "Stop moving the Link Copy option every other day!!! HATE where you buried the option to copy a link or share. So annoying! I have friends that stay on the app throughout the day because we constantly share links. We could do it quickly with the old format. Too many steps now mean we will spend less time on the app! We have tried it today. Massive FAIL! So unbelievably annoying and time consuming. I use the app less and so do friends when we can't find the copy link option to forward something.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "320.0.0.42.101",
        "reviewId": "1a446b94-4f0c-49be-9f77-a6f8105e9ee3",
        "score": 3,
        "thumbsUpCount": 251,
        "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocK3vggaQVML7tTmx3GPPntHXNKxoYab-m9ni-NyzJTOH00NTQ=mo",
        "userName": "T. H."
      },
      {
        "appVersion": "321.0.0.39.106",
        "at": "2024-03-11T02:08:20",
        "content": "Where to start? This app has never \"fit to frame\" anything... ever. I thought with the FB merge, this would be a priority, but no. (And we are talking about a photo and video app that sucks at both.) The latest is that videos on Stories start to play and freeze. It's ridiculous.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "321.0.0.39.106",
        "reviewId": "cd4a6025-ed5a-4d30-969c-aa142edd6472",
        "score": 1,
        "thumbsUpCount": 22,
        "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIFBhBD4rNIr4eBAZIWM3KlGtl6D-5brfoemoL1lx-dbUQvB_4=mo",
        "userName": "Mike F"
      },
      {
        "appVersion": "319.0.0.43.110",
        "at": "2024-02-24T03:24:41",
        "content": "My Explore page changed overnight with no influence of my own, the \"Not Interested\" choice on posts does absolutely nothing, and I'm now being recommended racist and completely irrelevant content. I want what I'm actually interested in back, and I've submitted four support requests in two weeks, all of which have vanished and I haven't got a single response. This app is going downhill fast, and I've already cleared my storage cache, uninstalled and reinstalled twice, and more.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "319.0.0.43.110",
        "reviewId": "bc0b14cc-637b-445a-9492-aca6e93a9bd9",
        "score": 1,
        "thumbsUpCount": 336,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU-i9aA2K57mBYehzxvThdYXbn3wVpRmG5r_uPfVwfs7UIBfwD9dg",
        "userName": "Z. Gibbons"
      },
      {
        "appVersion": "322.0.0.37.95",
        "at": "2024-03-13T22:46:58",
        "content": "The home feed autorefresh is out of control. If I set my phone down and the screen turns off or I look at any other app, it refreshed. Sometimes it refreshes my feed because I look at comments for more than a minute. It's an absolutely terrible user experience that you can't turn off the excessive automatic refreshing. Ypu can't even see the posts from people you follow because it's nonstop refreshing the feed. It's been an issue for some time and Meta just doesn't care to LET US TURN IT OFF.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "322.0.0.37.95",
        "reviewId": "b04e2e72-70bf-4981-bc91-0630f60e97b9",
        "score": 1,
        "thumbsUpCount": 136,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXqgnCAxyoILKMwX0aspEx8-_NZwXrzbLRuyCFaJ40skm1adHAW",
        "userName": "Izzy Bee"
      },
      {
        "appVersion": "323.0.0.35.65",
        "at": "2024-03-22T07:40:17",
        "content": "Instagram constantly closes out on me, becomes a glitchy mess when in dark mode, and sometimes doesn't open the app at all. Every new update to this app makes it more of a hellscape, it's the dumbest social media app that's out right now. I only use it for art and the algorithm is a nightmare. Just don't waste your time, even tiktok is better than this right now. It's too in your face, it hates the people that actually give them feedback, and it isn't worth fighting for yourself if they wrong u.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "323.0.0.35.65",
        "reviewId": "b82a245c-9cb6-43d6-8a3e-4d72dcf23a63",
        "score": 1,
        "thumbsUpCount": 16,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXqRFwy5BghQKky_suUatES0l8i-uWDtPLCINds8tMv-KUwhxi0",
        "userName": "Melting Narrator"
      },
      {
        "appVersion": "321.0.0.39.106",
        "at": "2024-03-12T08:25:36",
        "content": "App crashes often, features randomly stop working. It doesn't show you posts in chronological order. I just end up seeing posts from the same couple of accounts and a bunch of ads. My feed will say theres nothing new and start showing suggested posts, but then I'll click through accounts I follow, and there are several new posts it never showed me. Not at all user friendly, I just want to keep up with people and share things with my friends.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "321.0.0.39.106",
        "reviewId": "b6c35b8f-0f3a-44fc-9e1d-4d441fb975b5",
        "score": 1,
        "thumbsUpCount": 22,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVmxB8dBuuMdSb3h3edn6-KxApm3fNiUIcm6fwZ5sXMSqosoAv3",
        "userName": "sydney"
      },
      {
        "appVersion": "321.0.0.39.106",
        "at": "2024-03-09T20:08:19",
        "content": "I came back after being disgusted with Tik Tok and YouTube shorts. It is still dismal. They constantly try to get you to watch reels, which is super annoying. I also posted something, and it was immediately buried. Imagine trying to show your friend a picture on your phone, but somebody grabs your phone from your hand and puts one hundred photos on your phone that your friend has to scroll through to see your photo.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "321.0.0.39.106",
        "reviewId": "482800d8-1970-4252-ab40-345e0e5a1299",
        "score": 1,
        "thumbsUpCount": 46,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV6S9DSEv7vVK3HRw0lWfC1ccKeE9Z5_Vx6wOPtSRdE3o9YwE4",
        "userName": "Adam Lance"
      },
      {
        "appVersion": "322.0.0.37.95",
        "at": "2024-03-15T23:06:12",
        "content": "**Update** Insta has been an absolute headache recently. Since the last update the audio cuts out 1/4 - 1/2 way through videos I'm creating. I create the whole video, get the title ready, hashtags, etc only to find out the audio has cut out 1/3 of the way through the video. This is getting beyond frustrating. I'm not the only person this is happening to though as I've been in contact with other creators who have said the same happens to them.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "322.0.0.37.95",
        "reviewId": "8572d41d-34e1-4ba8-b9a3-eb87e13dcee0",
        "score": 1,
        "thumbsUpCount": 357,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXxaaGmCu0v5QjnOhFub843HQ0gR3hXr-puwwdQX7uaFFGGJwNt",
        "userName": "M.C. 3369"
      },
      {
        "appVersion": "315.0.0.29.109",
        "at": "2024-01-26T05:30:57",
        "content": "Recent updates have so many bugs. 1) Instagram no longer can see any photos or videos on my SD card, only internal memory. 2) Only way I can add a story is by going to my profile and clicking the + at the top. The + on the main feed screen results in an error. 3) I no longer have the ability to schedule posts. I used to have it, now it's gone. This is HUGE for a small business who needs to regularly post content. Please fix these issues ASAP! Android user if that makes a difference.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "315.0.0.29.109",
        "reviewId": "ba624310-efa0-45d2-918d-70847c568efe",
        "score": 2,
        "thumbsUpCount": 2443,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWs3Eo-mFurvdys6OKBhY8Xl0jka0C4tx0W-51mXLMZtmCHqoJn",
        "userName": "Kristie Anderson"
      },
      {
        "appVersion": "315.0.0.29.109",
        "at": "2024-01-27T02:02:58",
        "content": "If I can give the app a zero, I would. It used to be so nice, but it's complete trash now. The app won't read my SD card to post photos when it used to work just fine. It auto scrolls to the next reel, refreshes without warning. Now, it won't let me see older posts of people I follow when I click on that option. It's responsive only 2/3 of the time. I don't know what's happening and it needs to be fixed.",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "315.0.0.29.109",
        "reviewId": "d7201389-ceac-4ce2-b358-ece0cc9a31db",
        "score": 1,
        "thumbsUpCount": 1093,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV5WDmIJ4Dvb5seBMf5y5vNizdgys_0mDjN0955e3loHaFyJ4tP",
        "userName": "Rachel Harris"
      },
      {
        "appVersion": "315.0.0.29.109",
        "at": "2024-01-27T07:51:41",
        "content": "Was looking for an update because all of a sudden it's gotten SO buggy. I can't create reels w/o it glitching & me having to either start over, or save the draft & ex out of the app. Even posting pictures is the same way. I try to adjust the photos as I click them, so that they're just ready, & as soon as I click the check mark to continue, it resets the photos completely off what I had designated. If I try to edit in the section that's MADE 4 editing, it blacks out & crashes. Even more issues!",
        "repliedAt": null,
        "replyContent": null,
        "reviewCreatedVersion": "315.0.0.29.109",
        "reviewId": "e8507d5c-6aa2-4546-a640-fbf6c0d54f73",
        "score": 2,
        "thumbsUpCount": 905,
        "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWG5kkncxob5M2Nb9aPDcAkjlsm7RccnPCeZEKWgCDZ-0eysHCpcw",
        "userName": "Victoria Zarate"
      }
    ],
    "next_page_id": "eyJ0b2tlbiI6ICJDbThLYlFwck1Dd3hNREF4TURBd0xqWTVPREUxTnpBeE1qVXNOakl5TVRFNE1EazBOVFl5TENKb2RIUndPaTh2YldGeWEyVjBMbUZ1WkhKdmFXUXVZMjl0TDJSbGRHRnBiSE1fYVdROWRqSTZZMjl0TG1sdWMzUmhaM0poYlM1aGJtUnliMmxrT2pFaUxERXNabUZzYzJVIiwgImxhbmciOiAiZW4iLCAiY291bnRyeSI6ICJ1cyIsICJzb3J0IjogMSwgImNvdW50IjogMTAwLCAiZmlsdGVyX3Njb3JlX3dpdGgiOiAibnVsbCIsICJmaWx0ZXJfZGV2aWNlX3dpdGgiOiAyfQ=="
  },
  "tip": "You can read document or contact provider: https://www.idatariver.com/project/google-play-store-api-de67"
}